[
    "Talk is cheap. Show me the code.",
    "software is like sex : it's better when it's free..",
    "Bad programmers worry about the code. Good programmers worry about data structures and their relationships.",
    "Intelligence is the ability to avoid doing work, yet getting the work done.",
    "I like offending people, because I think people who get offended should be offended.",
    "Given enough eyeballs, all bugs are shallow.",
    "I am not a visionary. I'm an engineer. I'm happy with the people who are wandering around looking at the stars but I am looking at the ground and I want to fix the pothole before I fall in.",
    "Only wimps use tape backup. REAL men just upload their important stuff on ftp and let the rest of the world mirror it.",
    "I will, in fact, claim that the difference between a bad programmer and a good one is whether he considers his code or his data structures more important.Bad programmers worry about the code.Good programmers worry about data structures and their relationships.",
    "Most good programmers do programming not because they expect to get paid or get adulation by the public, but because it is fun to program.”“Don 't ever make the mistake [of thinking] that you can design something better than what you get from ruthless massively parallel trial-and-error with a feedback cycle. That's giving your intelligence much too much credit.",
    "Don't ever make the mistake [of thinking] that you can design something better than what you get from ruthless massively parallel trial-and-error with a feedback cycle. That's giving your intelligence much too much credit.",
    "Theory and practice sometimes clash. And when that happens, theory loses. Every single time.",
    "A lot of people believe in working long days and doing dou­ble, triple, or even quadruple shifts. I'm not one of them. Neither Transmeta nor Linux has ever gotten in the way of a good night's sleep. In fact, if you want to know the honest truth, I'm a firm believer in sleep. Some people think that's just being lazy, but I want to throw my pillow at them. I have a perfectly good excuse, and I'm standing by it: You may lose a few hours of your produc­tive daytime if you sleep, oh, say, ten hours a day, but those few hours when you are awake you're alert, and your brain functions on all six cylinders. Or four, or whatever.",
    "I'd argue that everybody wants to do something that matters",
    "I did learn fairly early that the best and most effective way to lead is by letting people do things because they want to do them, not because you want them to. The best leaders also know when they are wrong, and are capable of pulling themselves out. And the best leaders enable others to make decisions for them.",
    "Let me rephrase that. Much ofLinux's success can be attrib­uted to my own personality flaws: 1) I'm lazy; and 2) I like to get credit for the work of others.",
    "An ugly system is one in which there are special interfaces for everything you want to do. Unix is the opposite. It gives you the building blocks that are sufficient for doing everything. That's what having a clean design is all about.",
    "I want to decide for myself. I'm very much against unnecessary rules imposed by society. I'm a big believer that you should be able to do whatever you want in the privacy of your own home as long as you don't hurt anybody else. Any law saying otherwise is a very, very broken law. And there are laws that say otherwise. I find some scary rules, especially some that are imposed on schools and children. Imagine even thinking of imposing rules about teaching evolution, and taking that into the wrong direction. That I find scary. This is social conscience rearing its ugly head in places it really has nothing at all to do with.",
    "I'm a bastard. I have absolutely no clue why people can ever think otherwise. Yet they do. People think I'm a nice guy, and the fact is that I'm a scheming, conniving bastard who doesn't care for any hurt feelings or lost hours of work if it just results in what I consider to be a better system. And I'm not just saying that. I'm really not a very nice person. I can say 'I don't care' with a straight face, and really mean it.",
    "The theory behind open source is simple. In the case of an operating system, the source code-the programming instructions underlying the system-is free. Anyone can improve it, change it, exploit it. But those improvements, changes, and exploitations have to be made freely available. Think Zen. The project belongs to no one and to everyone. When a project is opened up, there is rapid and continual improvement. With teams of contributors working in parallel, the results can happen far more speedily and success­ fully than if the work were being conducted behind closed doors.",
    "For high school graduation in Finland, you wear a fluffy white hat with a black band. There's a ceremony in which they hand out diplomas, and when you come home all your relatives are there with lots of champagne, flowers, and cake. And there's also a party for the entire class at a local restaurant. We did all that, and I guess I had fun, but I don't remember anything special about it. But ask me about the specs on my 68008-chip machine and I can rattle them off with total recall.",
    "Benevolent dictator? No, I'm just lazy. I try to manage by not making decisions and letting things occur naturally. That's when you get the best results.",
    "So what this builds up to is that in the end we're all here to have fun. We might as well sit down and relax, and enjoy the ride.",
    "There are three things that have meaning for life. They are the motivational factors for everything in your life––for anything that you do or any living thing does: The first is survival, the second is social order, and the third is entertainment. Everything in life progresses in that order.",
    "Humans are destined to be party animals, and technology will follow.",
    "This probably also means that if and when we ever meet another intelligent life form in this universe, their first words are not likely to be 'Take me to our leader.' They're more likely to say 'Party on, dude!'"
]